---
kind: method
id: M:Autodesk.Revit.DB.Parameter.GetTypeId
zh: 参数、共享参数
source: html/03251b25-046d-1cd2-2b6d-85726f8593e5.htm
---
# Autodesk.Revit.DB.Parameter.GetTypeId Method

**中文**: 参数、共享参数

Gets the identifier of the parameter.

## Syntax (C#)
```csharp
public ForgeTypeId GetTypeId()
```